history.org
#+TITLE: Past releases of the Mathematical Components library
#+OPTIONS: toc:nil
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+HTML_HEAD: <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
#+HTML_HEAD: <style type="text/css"> body {font-family: Arial, Helvetica; margin-left: 5em; font-size: large;} </style>
#+HTML_HEAD: <style type="text/css"> h1 {margin-left: 0em; padding: 0px; text-align: center} </style>
#+HTML_HEAD: <style type="text/css"> h2 {margin-left: 0em; padding: 0px; color: #580909} </style>
#+HTML_HEAD: <style type="text/css"> h3 {margin-left: 1em; padding: 0px; color: #C05001;} </style>
#+HTML_HEAD: <style type="text/css"> body { max-width: 1100px; width: 100% - 30px; margin-left: 30px; }</style>

- Graph of the files of the Mathematical Components library and HTML
  rendering to be explored interactively online:
  + Version 2.1.0 (2023-10-24): [[file:htmldoc_2_1_0/libgraph.html][library graph]], [[file:htmldoc_2_1_0/index.html][coqdoc presentation]]
  + Version 2.0.0 (2023-05-10): [[file:htmldoc_2_0_0/libgraph.html][library graph]], [[file:htmldoc_2_0_0/index.html][coqdoc presentation]]
  + Version 1.19.0 (2024-01-15): [[file:htmldoc_1_19_0/libgraph.html][library graph]], [[file:htmldoc_1_19_0/index.html][coqdoc presentation]]
  + Version 1.18.0 (2023-11-01): [[file:htmldoc_1_18_0/libgraph.html][library graph]], [[file:htmldoc_1_18_0/index.html][coqdoc presentation]]
  + Version 1.17.0 (2023-05-09): [[file:htmldoc_1_17_0/libgraph.html][library graph]], [[file:htmldoc_1_17_0/index.html][coqdoc presentation]]
  + Version 1.16.0 (2023-02-01): [[file:htmldoc_1_16_0/libgraph.html][library graph]], [[file:htmldoc_1_16_0/index.html][coqdoc presentation]]
  + Version 2.0+alpha1 (2022-12-05): [[file:htmldoc_2_0_alpha1/libgraph.html][library graph]], [[file:htmldoc_2_0_alpha1/index.html][coqdoc presentation]]
  + Version 1.15.0 (2022-06-30): [[file:htmldoc_1_15_0/libgraph.html][library graph]], [[file:htmldoc_1_15_0/index.html][coqdoc presentation]]
  + Version 1.14.0 (2022-01-19): [[file:htmldoc_1_14_0/libgraph.html][library graph]], [[file:htmldoc_1_14_0/index.html][coqdoc presentation]]
  + Version 1.13.0 (2021-10-28): [[file:htmldoc_1_13_0/libgraph.html][library graph]], [[file:htmldoc_1_13_0/index.html][coqdoc presentation]]
  + Version 1.12.0 (2020-11-26): [[file:htmldoc_1_12_0/libgraph.html][library graph]], [[file:htmldoc_1_12_0/index.html][coqdoc presentation]]
  + Version 1.11.0 (2020-06-09): [[file:htmldoc_1_11_0/libgraph.html][library graph]], [[file:htmldoc_1_11_0/index.html][coqdoc presentation]]
  + Version 1.10.0 (2019-11-29): [[file:htmldoc_1_10_0/libgraph.html][library graph]], [[file:htmldoc_1_10_0/index.html][coqdoc presentation]]
- The past stable releases of the Mathematical Components library
  can be [[https://github.com/math-comp/math-comp/releases][downloaded from github]].
- Older versions of the Mathematical Components library are also available:
  + [[https://github.com/math-comp/math-comp/releases/tag/archive][historical archives]] (2008-2014)
  + [[https://github.com/math-comp/mathcomp-history-before-github][pre-github archive]]
