history.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-11-13 Thu 11:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Past releases of the Mathematical Components library</title>
<meta name="author" content="Reynald Affeldt" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Past releases of the Mathematical Components library</h1>
<ul class="org-ul">
<li>Graph of the files of the Mathematical Components library and HTML
rendering to be explored interactively online:
<ul class="org-ul">
<li>Version 2.1.0 (2023-10-24): <a href="htmldoc_2_1_0/libgraph.html">library graph</a>, <a href="htmldoc_2_1_0/index.html">coqdoc presentation</a></li>
<li>Version 2.0.0 (2023-05-10): <a href="htmldoc_2_0_0/libgraph.html">library graph</a>, <a href="htmldoc_2_0_0/index.html">coqdoc presentation</a></li>
<li>Version 1.19.0 (2024-01-15): <a href="htmldoc_1_19_0/libgraph.html">library graph</a>, <a href="htmldoc_1_19_0/index.html">coqdoc presentation</a></li>
<li>Version 1.18.0 (2023-11-01): <a href="htmldoc_1_18_0/libgraph.html">library graph</a>, <a href="htmldoc_1_18_0/index.html">coqdoc presentation</a></li>
<li>Version 1.17.0 (2023-05-09): <a href="htmldoc_1_17_0/libgraph.html">library graph</a>, <a href="htmldoc_1_17_0/index.html">coqdoc presentation</a></li>
<li>Version 1.16.0 (2023-02-01): <a href="htmldoc_1_16_0/libgraph.html">library graph</a>, <a href="htmldoc_1_16_0/index.html">coqdoc presentation</a></li>
<li>Version 2.0+alpha1 (2022-12-05): <a href="htmldoc_2_0_alpha1/libgraph.html">library graph</a>, <a href="htmldoc_2_0_alpha1/index.html">coqdoc presentation</a></li>
<li>Version 1.15.0 (2022-06-30): <a href="htmldoc_1_15_0/libgraph.html">library graph</a>, <a href="htmldoc_1_15_0/index.html">coqdoc presentation</a></li>
<li>Version 1.14.0 (2022-01-19): <a href="htmldoc_1_14_0/libgraph.html">library graph</a>, <a href="htmldoc_1_14_0/index.html">coqdoc presentation</a></li>
<li>Version 1.13.0 (2021-10-28): <a href="htmldoc_1_13_0/libgraph.html">library graph</a>, <a href="htmldoc_1_13_0/index.html">coqdoc presentation</a></li>
<li>Version 1.12.0 (2020-11-26): <a href="htmldoc_1_12_0/libgraph.html">library graph</a>, <a href="htmldoc_1_12_0/index.html">coqdoc presentation</a></li>
<li>Version 1.11.0 (2020-06-09): <a href="htmldoc_1_11_0/libgraph.html">library graph</a>, <a href="htmldoc_1_11_0/index.html">coqdoc presentation</a></li>
<li>Version 1.10.0 (2019-11-29): <a href="htmldoc_1_10_0/libgraph.html">library graph</a>, <a href="htmldoc_1_10_0/index.html">coqdoc presentation</a></li>
</ul></li>
<li>The past stable releases of the Mathematical Components library
can be <a href="https://github.com/math-comp/math-comp/releases">downloaded from github</a>.</li>
<li>Older versions of the Mathematical Components library are also available:
<ul class="org-ul">
<li><a href="https://github.com/math-comp/math-comp/releases/tag/archive">historical archives</a> (2008-2014)</li>
<li><a href="https://github.com/math-comp/mathcomp-history-before-github">pre-github archive</a></li>
</ul></li>
</ul>
</div>
</body>
</html>
